schedulr-backend/app/controllers/api/v1/providers_controller.rb

SELECT "providers".* FROM "providers"
---
  def index
    @providers = Provider.all

SELECT  "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_provider
    @provider = Provider.find(params[:id])