schedulr-backend/app/controllers/api/v1/slots_controller.rb

SELECT "slots".* FROM "slots"
---
  def index
    @slots = Slot.all

SELECT  "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_slot
    @slot = Slot.find(params[:id])